class ListRecomment {
  final String name;
  final String img;
  final String detail;
  final String date;

  ListRecomment(
      {required this.name,
      required this.img,
      required this.detail,
      required this.date});
}

List<ListRecomment> ListRecomPage = [
  ListRecomment(
      name: "วัดพระแก้ว",
      img: "assets/img/recom_view/tavel.jpg",
      detail:
          "วัดพระศรีรัตนศาสดารามหรือวัดพระแก้วเป็นวัดสำคัญของประเทศไทย อยู่คู่บ้านคู่เมืองมาตั้งแต่สมัยรัชกาลที่ 1 เนื่องจากรัชกาลที่ 1 โปรดเกล้าฯ ให้สร้างขึ้นใน พ.ศ. 2325 วัดพระศรีรัตนศาสดารามเป็นส่วนหนึ่งของพระบรมมหาราชวัง ตั้งอยู่ในเขตพระราชฐานชั้นนอก ภายในพระอุโบสถตกแต่งอย่างวิจิตรงดงามและเป็นที่ประดิษฐานของพระพุทธมหามณีรัตนปฏิมากรหรือพระแก้วมรกต นอกจากนี้ภายในวัดยังแบ่งกลุ่มอาคารออกเป็น 3 กลุ่ม ได้แก่ กลุ่มพระอุโบสถ กลุ่มฐานไพที กลุ่มอาคารและสิ่งประดับอื่นๆ ซึ่งควรค่าแก่การไปกราบไหว้พระขอพร รวมถึงชื่นชมความสวยงามของสถาปัตยกรรมภายในวัดเป็นอย่างยิ่ง",
      date: "12/08/2566"),
  ListRecomment(
      name: "วัดพระแก้ว",
      img: "assets/img/recom_view/tavel.jpg",
      detail:
          "วัดพระศรีรัตนศาสดารามหรือวัดพระแก้วเป็นวัดสำคัญของประเทศไทย อยู่คู่บ้านคู่เมืองมาตั้งแต่สมัยรัชกาลที่ 1 เนื่องจากรัชกาลที่ 1 โปรดเกล้าฯ ให้สร้างขึ้นใน พ.ศ. 2325 วัดพระศรีรัตนศาสดารามเป็นส่วนหนึ่งของพระบรมมหาราชวัง ตั้งอยู่ในเขตพระราชฐานชั้นนอก ภายในพระอุโบสถตกแต่งอย่างวิจิตรงดงามและเป็นที่ประดิษฐานของพระพุทธมหามณีรัตนปฏิมากรหรือพระแก้วมรกต นอกจากนี้ภายในวัดยังแบ่งกลุ่มอาคารออกเป็น 3 กลุ่ม ได้แก่ กลุ่มพระอุโบสถ กลุ่มฐานไพที กลุ่มอาคารและสิ่งประดับอื่นๆ ซึ่งควรค่าแก่การไปกราบไหว้พระขอพร รวมถึงชื่นชมความสวยงามของสถาปัตยกรรมภายในวัดเป็นอย่างยิ่ง",
      date: "12/08/2566"),
  ListRecomment(
      name: "วัดพระแก้ว",
      img: "assets/img/recom_view/tavel.jpg",
      detail:
          "วัดพระศรีรัตนศาสดารามหรือวัดพระแก้วเป็นวัดสำคัญของประเทศไทย อยู่คู่บ้านคู่เมืองมาตั้งแต่สมัยรัชกาลที่ 1 เนื่องจากรัชกาลที่ 1 โปรดเกล้าฯ ให้สร้างขึ้นใน พ.ศ. 2325 วัดพระศรีรัตนศาสดารามเป็นส่วนหนึ่งของพระบรมมหาราชวัง ตั้งอยู่ในเขตพระราชฐานชั้นนอก ภายในพระอุโบสถตกแต่งอย่างวิจิตรงดงามและเป็นที่ประดิษฐานของพระพุทธมหามณีรัตนปฏิมากรหรือพระแก้วมรกต นอกจากนี้ภายในวัดยังแบ่งกลุ่มอาคารออกเป็น 3 กลุ่ม ได้แก่ กลุ่มพระอุโบสถ กลุ่มฐานไพที กลุ่มอาคารและสิ่งประดับอื่นๆ ซึ่งควรค่าแก่การไปกราบไหว้พระขอพร รวมถึงชื่นชมความสวยงามของสถาปัตยกรรมภายในวัดเป็นอย่างยิ่ง",
      date: "12/08/2566"),
  ListRecomment(
      name: "วัดพระแก้ว",
      img: "assets/img/recom_view/tavel.jpg",
      detail:
          "วัดพระศรีรัตนศาสดารามหรือวัดพระแก้วเป็นวัดสำคัญของประเทศไทย อยู่คู่บ้านคู่เมืองมาตั้งแต่สมัยรัชกาลที่ 1 เนื่องจากรัชกาลที่ 1 โปรดเกล้าฯ ให้สร้างขึ้นใน พ.ศ. 2325 วัดพระศรีรัตนศาสดารามเป็นส่วนหนึ่งของพระบรมมหาราชวัง ตั้งอยู่ในเขตพระราชฐานชั้นนอก ภายในพระอุโบสถตกแต่งอย่างวิจิตรงดงามและเป็นที่ประดิษฐานของพระพุทธมหามณีรัตนปฏิมากรหรือพระแก้วมรกต นอกจากนี้ภายในวัดยังแบ่งกลุ่มอาคารออกเป็น 3 กลุ่ม ได้แก่ กลุ่มพระอุโบสถ กลุ่มฐานไพที กลุ่มอาคารและสิ่งประดับอื่นๆ ซึ่งควรค่าแก่การไปกราบไหว้พระขอพร รวมถึงชื่นชมความสวยงามของสถาปัตยกรรมภายในวัดเป็นอย่างยิ่ง",
      date: "12/08/2566"),
];
