class ListRecomment {
  final String name;
  final String img;
  final String detail;
  final String date;

  ListRecomment(
      {required this.name,
      required this.img,
      required this.detail,
      required this.date});
}

List<ListRecomment> ListRecomPage = [
  ListRecomment(
      name: "วัดพระแก้ว",
      img: "img/recom_view/tavel.jpg",
      detail:
          "วัดพระศรีรัตนศาสดารามหรือวัดพระแก้วเป็นวัดสำคัญของประเทศไทย อยู่คู่บ้านคู่เมืองมาตั้งแต่สมัยรัชกาลที่ 1 เนื่องจากรัชกาลที่ 1 โปรดเกล้าฯ ให้สร้างขึ้นใน พ.ศ. 2325 วัดพระศรีรัตนศาสดารามเป็นส่วนหนึ่งของพระบรมมหาราชวัง ตั้งอยู่ในเขตพระราชฐานชั้นนอก ภายในพระอุโบสถตกแต่งอย่างวิจิตรงดงามและเป็นที่ประดิษฐานของพระพุทธมหามณีรัตนปฏิมากรหรือพระแก้วมรกต นอกจากนี้ภายในวัดยังแบ่งกลุ่มอาคารออกเป็น 3 กลุ่ม ได้แก่ กลุ่มพระอุโบสถ กลุ่มฐานไพที กลุ่มอาคารและสิ่งประดับอื่นๆ ซึ่งควรค่าแก่การไปกราบไหว้พระขอพร รวมถึงชื่นชมความสวยงามของสถาปัตยกรรมภายในวัดเป็นอย่างยิ่ง",
      date: "12/08/2566"),
  ListRecomment(
      name: "ร้านฟาร์มฮัก",
      img: "img/recom_view/res.jpg",
      detail:
          "ร้านปิ้งย่างโคขุนในสกลนครมีเยอะมากกก หลายร้านหลายทำเล ร้านนี้ก็เป็นอีกร้านอาหารสกลนครแห่งหนึ่งที่เป็นที่ยอดนิยมของชาวสกลนคร จัดร้านเป็นสวน ๆ ร่มรื่นดีครับ มีทั้งอาหารจานเดียว เมนูโคขุนกะทะร้อนต่าง ๆ บริการ หอมไปทั้งร้าน วันนี้ผมมาเน้นปิ้งย่างครับ กระทะปิ้งย่างของที่นี่แปลกกว่าที่อื่น มาแบบถาด ๆ เปล ๆ สีดำ ๆ ให้ฟีลเกาหลีดีนะครับเวลาย่าง จ๊วดดดด เนื้อเวลาโดนกระทะแบบนี้ มันหอมมากจริง ๆ น้ำจิ้ม มีหลายแบบเลือกจิ้มตามชอบเลยครับ อร่อยนะ อร่อยจริง ๆ” (โดยคุณ Pipatpong Promchan) อ่านต่อได้ที่ https://www.wongnai.com/listings/sakonnakhon-restaurants?ref=ct",
      date: "20/08/2566"),
  ListRecomment(
      name: "Ballerina",
      img: "img/recom_view/movie.jpg",
      detail:
          "นรอบปีที่ผ่านมาถือว่าหนังเกาหลีทางสตรีมมิงไปได้สุดอยู่หลายเรื่อง และกลายเป็นคอนเทนท์ที่ทั่วโลกต้องจับตามองอยู่เสมอ ๆ แล้วก็มาถึงคิวล่าสุดของหนังแอคชันเดือดดาลพลังหญิง อย่าง Ballerina ร่ายระบำฆ่า ที่ได้กลิ่นอายความดิบเถื่อนโชยออกมาตั้งแต่บนใบปิดเลย นี่อาจจะเป็นหนังบู๊ระห่ำ ที่อาจจะมาสร้างเป็นบรรทัดฐานใหม่ให้กับสายหนังแอคชันเกาหลีอีกเรื่องก็เป็นไปได้",
      date: "30/10/2566"),
  ListRecomment(
      name:
          "สรุปข้อคิดจากหนังสือ “THE HAPPIEST PERSON IN THE ROOM อยู่เย็นเป็นสูตร”",
      img: "img/recom_view/book.png",
      detail:
          "ถ้าสิ่งของที่ซื้อมาไม่มีคุณสมบัติที่จะทำให้เราต้องนึกถึงมันบ่อยๆ ยิ่งนานเข้าความชินชามักจะมาแทนที่ความเป็นของใหม่ของสิ่งที่เราเพิ่งซื้อไป ถ้าสิ่งของที่ซื้อมาไม่ได้มีกลไกที่จะทำให้เราต้องนึกถึงคุณค่าของมัน หรือประโยชน์ที่เราได้จากการใช้มันบ่อยๆ ความสุขที่เราได้จากการมีสิ่งของนั้นจะค่อยๆ ลดลง",
      date: "15/10/2566"),
];
